Repository: applingua/WelshAppTMX
Catalog: Welsh App TMX by Applingua Ltd.tmx
Source language: en
Languages: cy

source: About & Contact
cy: Ynglŷn ag a Chysylltu

source: Low Energy
cy: Ynni isel

source: Bluetooth Low Energy
cy: Ynni Isel Bluetooth

source: Island
cy: Ynys

source: Germany
cy: Yr Almaen

source: Currency that you use
cy: Yr arian cyfred a ddefnyddiwch

source: Italy
cy: Yr Eidal

source: UAE
cy: Yr Emiraethau Arabaidd Unedig

source: United Arab Emirates
cy: Yr Emiraethau Arabaidd Unedig

source: Canary Islands
cy: Yr Ynysoedd Dedwydd

source: Activate
cy: Ysgogi

source: Write a Review
cy: Ysgrifennu adolygiad

source: Write a message
cy: Ysgrifennu neges

source: Write a little something about yourself
cy: Ysgrifennwch ychydig amdanoch chi'ch hun

source: Statistics
cy: Ystadegau

source: Stats
cy: Ystadegau

source: Time Range:
cy: Ystod amser:

source: Pause Position
cy: Ystum Rhewi

source: Gestures
cy: Ystumiau
